/*Console.Write("Введите число, квадрат которого, вы желаете получить");
int num = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"Квадрат числа {num} -> {num*num}");*/

//-------------------------------------

//задача 2 Нужно вычислить, является ли первое вводимое число, квадратом второго
// 5 25?

// System.Console.WriteLine("Введите первое число - >");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Введите второе число - >");
// int num2 = Convert.ToInt32(Console.ReadLine());

// int quad = num2*num2;

// if(num1==quad)
// {
//     System.Console.WriteLine($"Первое число {num1} является квадратом втогоро числа {num2}");
// }

// else
// {
//     System.Console.WriteLine($"Первое число {num1} не является квадратом второго числа {num2}");
// }

//--------------------------------------

//Задача 3 
//Написать програму, котороая принимает число N и выводит послежлвательность чисел от -N до N

// System.Console.WriteLine("Введите число N ->");
// int n = Convert.ToInt32(Console.ReadLine());

// int current = n * (-1);

// while (current <= n)
// {
//     System.Console.Write(current + " ");
//     current ++;
// }

//-------------------------------------

//Задача 4
//Дается 3хзначное число, необходимо вывести последнюю цифру числа

// System.Console.WriteLine("Введите трехзначное число -> ");
// int num = Convert.ToInt32(Console.ReadLine());

// if( num >= 100 && num <= 999)
// {
//     System.Console.WriteLine(num % 10);
// }
// else
// {
//     System.Console.WriteLine("Ты втираешь мне какую то дичь!!!");
// }

